# =========================================
# GuardianX Dataset - Day 2
# =========================================

DATA = [

    # safe
    ("مرحبا كيف حالك", "safe"),
    ("وينك اليوم", "safe"),
    ("شكرا جزيلا", "safe"),
    ("موعدنا غدا", "safe"),

    # scam
    ("فزت بجائزة كبرى اضغط الرابط", "scam"),
    ("تم اختيارك لربح مليون دولار", "scam"),
    ("اضغط هنا لاستلام الجائزة", "scam"),
    ("ارسل بياناتك البنكية فوراً", "scam"),

    # threat
    ("سأنشر صورك اذا لم تدفع", "threat"),
    ("ادفع المال والا سافضحك", "threat"),
    ("سأؤذيك اذا تجاهلتني", "threat"),
    ("لدينا معلوماتك الخاصة وسننشرها", "threat")
]


LABELS = {
    "safe": 0,
    "scam": 1,
    "threat": 2
}




